-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Servidor: 127.0.0.1
-- Tiempo de generación: 25-09-2024 a las 14:56:48
-- Versión del servidor: 10.4.32-MariaDB
-- Versión de PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `rotar`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `empleados`
--

CREATE TABLE `empleados` (
  `contador` int(4) NOT NULL,
  `num_identificacion` varchar(15) DEFAULT NULL,
  `nombre` varchar(65) NOT NULL,
  `apellido` varchar(65) NOT NULL,
  `estado` varchar(8) NOT NULL DEFAULT 'ACTIVO'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Volcado de datos para la tabla `empleados`
--

INSERT INTO `empleados` (`contador`, `num_identificacion`, `nombre`, `apellido`, `estado`) VALUES
(1, '1112038485', 'Dilan', 'Zapata', 'ACTIVO');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `lotes`
--

CREATE TABLE `lotes` (
  `contador_lotes` int(11) NOT NULL,
  `nombre_lote` varchar(5) NOT NULL,
  `estado_lote` varchar(8) NOT NULL DEFAULT 'ACTIVO',
  `potrero_actual` varchar(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Volcado de datos para la tabla `lotes`
--

INSERT INTO `lotes` (`contador_lotes`, `nombre_lote`, `estado_lote`, `potrero_actual`) VALUES
(1, '0', 'ACTIVO', '000'),
(2, '1', 'ACTIVO', '007'),
(3, '2', 'ACTIVO', '000'),
(4, '4', 'ACTIVO', '000'),
(5, '5', 'ACTIVO', '000'),
(6, '7', 'ACTIVO', '000'),
(7, '8', 'ACTIVO', '000'),
(8, '9', 'ACTIVO', '000');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `potreros`
--

CREATE TABLE `potreros` (
  `contador_potreros` int(11) NOT NULL,
  `num_potrero` varchar(3) DEFAULT NULL,
  `nombre` varchar(7) NOT NULL DEFAULT 'potrero',
  `fecha_hora_ultm_sal` datetime NOT NULL,
  `fehca_hora_ultm_ent` datetime NOT NULL,
  `estado_potrero` varchar(7) NOT NULL DEFAULT 'Libre',
  `lote_vacas` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Volcado de datos para la tabla `potreros`
--

INSERT INTO `potreros` (`contador_potreros`, `num_potrero`, `nombre`, `fecha_hora_ultm_sal`, `fehca_hora_ultm_ent`, `estado_potrero`, `lote_vacas`) VALUES
(1, '001', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(2, '002', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(3, '003', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(4, '004', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(5, '005', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(6, '006', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(7, '007', 'POTRERO', '0000-00-00 00:00:00', '2024-09-21 11:36:43', 'Ocupado', '1'),
(8, '008', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(9, '009', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(10, '010', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(11, '011', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(12, '012', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(13, '013', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(14, '014', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(15, '015', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(16, '016', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(17, '017', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(18, '018', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(19, '019', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(20, '020', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(21, '021', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(22, '022', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(23, '023', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(24, '024', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(25, '025', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(26, '026', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(27, '027', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(28, '028', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(29, '029', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(30, '030', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(31, '031', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(32, '032', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(33, '033', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(34, '034', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(35, '035', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(36, '036', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(37, '037', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(38, '038', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(39, '039', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(40, '040', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(41, '041', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(42, '042', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(43, '043', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(44, '044', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(45, '045', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(46, '046', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(47, '047', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(48, '048', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(49, '049', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(50, '050', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(51, '051', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(52, '052', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(53, '053', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(54, '054', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(55, '055', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(56, '056', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(57, '057', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(58, '058', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(59, '059', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(60, '060', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(61, '061', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(62, '062', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(63, '063', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(64, '064', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(65, '065', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(66, '066', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(67, '067', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(68, '068', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(69, '069', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(70, '070', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(71, '071', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(72, '072', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(73, '073', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(74, '074', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(75, '075', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(76, '076', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(77, '077', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(78, '078', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(79, '079', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(80, '080', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(81, '081', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(82, '082', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(83, '083', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(84, '084', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(85, '085', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(86, '086', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(87, '087', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(88, '088', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(89, '089', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(90, '090', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(91, '091', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(92, '092', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(93, '093', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(94, '094', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(95, '095', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(96, '096', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(97, '097', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(98, '098', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(99, '099', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(100, '100', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(101, '101', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(102, '102', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(103, '103', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(104, '104', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(105, '105', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(106, '106', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(107, '107', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(108, '108', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(109, '109', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(110, '110', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(111, '111', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(112, '112', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(113, '113', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(114, '114', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(115, '115', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(116, '116', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(117, '117', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(118, '118', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(119, '119', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(120, '120', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(121, '121', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(122, '122', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(123, '123', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(124, '124', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(125, '125', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(126, '126', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(127, '127', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(128, '128', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(129, '129', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(130, '130', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(131, '131', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(132, '132', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(133, '133', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(134, '134', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(135, '135', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(136, '136', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(137, '137', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(138, '138', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(139, '139', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(140, '140', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(141, '141', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(142, '142', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(143, '143', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(144, '144', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(145, '145', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(146, '146', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(147, '147', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(148, '148', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(149, '149', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(150, '150', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(151, '151', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(152, '152', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(153, '153', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(154, '154', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(155, '155', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(156, '156', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(157, '157', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(158, '158', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(159, '159', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(160, '160', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(161, '161', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(162, '162', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(163, '163', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(164, '164', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(165, '165', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(166, '166', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(167, '167', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(168, '168', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(169, '169', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(170, '170', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(171, '171', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(172, '172', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(173, '173', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(174, '174', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(175, '175', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(176, '176', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(177, '177', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(178, '178', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(179, '179', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(180, '180', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(181, '181', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', ''),
(182, '182', 'POTRERO', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Libre', '');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `registro`
--

CREATE TABLE `registro` (
  `contador_registro` int(11) NOT NULL,
  `tipo_registro` varchar(7) DEFAULT NULL,
  `fecha_hora_registro` datetime NOT NULL,
  `num_potrero` varchar(3) DEFAULT NULL,
  `nombre` varchar(7) NOT NULL DEFAULT 'potrero',
  `fecha_hora_ultm_sal` datetime NOT NULL,
  `fehca_hora_ultm_ent` datetime NOT NULL,
  `estado_potrero` varchar(17) NOT NULL DEFAULT '0',
  `lote_vacas` varchar(5) NOT NULL,
  `empleado` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Volcado de datos para la tabla `registro`
--

INSERT INTO `registro` (`contador_registro`, `tipo_registro`, `fecha_hora_registro`, `num_potrero`, `nombre`, `fecha_hora_ultm_sal`, `fehca_hora_ultm_ent`, `estado_potrero`, `lote_vacas`, `empleado`) VALUES
(1, 'SALIDA', '2024-09-21 11:38:59', '000', 'potrero', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Dias de Ocupacion', '1', ''),
(2, 'ENTRADA', '2024-09-21 11:38:59', '007', 'potrero', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 'Dias de Descanso', '1', '');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `usuarios_sys`
--

CREATE TABLE `usuarios_sys` (
  `num_identificacion_usuario` varchar(15) NOT NULL,
  `rol_usuario` varchar(3) NOT NULL DEFAULT 'VS',
  `estado_usuario` varchar(10) NOT NULL DEFAULT 'ACTIVO'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Volcado de datos para la tabla `usuarios_sys`
--

INSERT INTO `usuarios_sys` (`num_identificacion_usuario`, `rol_usuario`, `estado_usuario`) VALUES
('1112038485', 'VI', 'ACTIVO');

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `empleados`
--
ALTER TABLE `empleados`
  ADD PRIMARY KEY (`contador`);

--
-- Indices de la tabla `lotes`
--
ALTER TABLE `lotes`
  ADD PRIMARY KEY (`contador_lotes`);

--
-- Indices de la tabla `potreros`
--
ALTER TABLE `potreros`
  ADD PRIMARY KEY (`contador_potreros`);

--
-- Indices de la tabla `registro`
--
ALTER TABLE `registro`
  ADD PRIMARY KEY (`contador_registro`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `empleados`
--
ALTER TABLE `empleados`
  MODIFY `contador` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT de la tabla `lotes`
--
ALTER TABLE `lotes`
  MODIFY `contador_lotes` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT de la tabla `potreros`
--
ALTER TABLE `potreros`
  MODIFY `contador_potreros` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=183;

--
-- AUTO_INCREMENT de la tabla `registro`
--
ALTER TABLE `registro`
  MODIFY `contador_registro` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
